clc
close all
Vwind=[5,4.8,4.5,2,3,3.5,4.8,5,7,5,8.5,8,4,7.5,8.5,4.5,5.5,5.3,4,6,7,8.3,4.3,7];
Light=[0,0,0,0,0,200,400,600,800,900,980,1000,980,900,800,600,400,200,0,0,0,0,0,0];
Temp=[26,25,24,23,25,26,27,28,29,30,31,32,33,34,33,32,31,30,29,28,27,26,25,24];
figure
plot(1:24,Vwind,'ok-')
title('风速预测曲线');
legend('典型日风俗曲线');
xlabel('时间/小时')
ylabel('风俗m/s')
figure
plot(1:24,Light,'*-')
title('光照强度预测曲线');
legend('典型日光照强度');
xlabel('时间/小时')
ylabel('光照强度w/m^2元')
figure
plot(1:24,Temp,'-x')
title('温度预测曲线');
legend('典型日温度曲线');
xlabel('时间/小时')
ylabel('温度（摄氏度）')


